; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v6)
             (pred_12 ?v11 ?v5)
             (pred_11 ?v12 ?v5)
             (pred_6 ?v10 ?v12 )
	     (pred_7 ?v12)
             (pred_2 ?v1)
             (pred_10 ?v11)
             (pred_4 ?v5)
             (pred_1 ?v12)
             (pred_5 ?v11)
             (pred_8 ?v12)
             (pred_9 ))



(:action op_3
:parameters (?v9 ?v13 ?v8 ?v4)
:precondition (and (pred_2 ?v9) (pred_2 ?v13) (pred_10 ?v8) (pred_4 ?v4)
          (pred_3 ?v9 ?v13) (pred_12 ?v8 ?v4)
                   (pred_11 ?v13 ?v4) (pred_7 ?v9) 
                   (pred_1 ?v13) (pred_5 ?v8))
:effect (and  (pred_8 ?v13) (not (pred_1 ?v13))))


(:action op_2
:parameters (?v9 ?v3)
:precondition (and (pred_2 ?v9) (pred_2 ?v3)
               (pred_7 ?v9) (pred_3 ?v9 ?v3) (pred_8 ?v3))
:effect (and (pred_7 ?v3) (not (pred_7 ?v9))))

(:action op_1
:parameters (?v9 ?v8)
:precondition (and (pred_2 ?v9) (pred_10 ?v8) 
                  (pred_7 ?v9) (pred_6 ?v8 ?v9) (pred_9 ))
:effect (and (pred_5 ?v8)
   (not (pred_6 ?v8 ?v9)) (not (pred_9 ))))


(:action op_4
:parameters (?v9 ?v2 ?v7)
:precondition (and (pred_2 ?v9) (pred_10 ?v2) (pred_10 ?v7)
                  (pred_7 ?v9) (pred_5 ?v7) (pred_6 ?v2 ?v9))
:effect (and (pred_5 ?v2) (pred_6 ?v7 ?v9)
        (not (pred_5 ?v7)) (not (pred_6 ?v2 ?v9))))

(:action op_5
:parameters (?v9 ?v8)
:precondition (and (pred_2 ?v9) (pred_10 ?v8) 
                  (pred_7 ?v9) (pred_5 ?v8))
:effect (and (pred_9 ) (pred_6 ?v8 ?v9) (not (pred_5 ?v8)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_07 obj_10 obj_05 obj_09 obj_13 obj_01 obj_11 obj_04
    obj_03 obj_02
    obj_12 obj_08
    )

    (:init
       (pred_9)

       (pred_2 obj_06)
       (pred_2 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_05)
       (pred_2 obj_09)
       (pred_2 obj_13)
       (pred_2 obj_01)
       (pred_2 obj_11)
       (pred_2 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_10 obj_12)
       (pred_10 obj_08)

       (pred_3 obj_06 obj_05)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_07 obj_10)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_07)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_04 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_11  obj_13 obj_03)
       (pred_11  obj_10 obj_02)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_04)

       (pred_12  obj_12 obj_03)
       (pred_12  obj_08 obj_02)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_08 obj_11)
       (pred_7 obj_04)
    )

    (:goal (and
       (pred_6 obj_08 obj_06)
    ))
(:constraints
  (always (not (pred_7 obj_09)))
)
)

; plan
1. (op_2 obj_04 obj_11)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_11)
   goals met: 0 of 1
2. (op_1 obj_11 obj_08)
   deleted: (pred_6 obj_08 obj_11) (pred_9)
   added: (pred_5 obj_08)
   goals met: 0 of 1
3. (op_2 obj_11 obj_01)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_01)
   goals met: 0 of 1
4. (op_2 obj_01 obj_05)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_05)
   goals met: 0 of 1
5. (op_2 obj_05 obj_06)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_06)
   goals met: 0 of 1
6. (op_5 obj_06 obj_08)
   deleted: (pred_5 obj_08)
   added: (pred_9) (pred_6 obj_08 obj_06)
   goals met: 1 of 1
